* 困难活动列表:
** 2022/03/17
| 活动                  | 难度 | 喜悦度 | 完成情况 |  HP |  MP | Goal |   StHP |
|-----------------------+------+--------+----------+-----+-----+------+--------|
| 写程序分析结果        |   65 |     70 |        0 |   0 |   0 |  100 |      0 |
| 写文章形成文字        |   85 |     80 |        0 |   0 |   0 |  100 |      0 |
| 练吉他                |   40 |     50 |        0 |   0 |   0 |   50 |      0 |
| 健身环                |   60 |     60 |        0 |   0 |   0 |   60 |      0 |
| 逛超市                |   65 |     70 |        1 |  70 |  65 |   70 |    100 |
| 出门                  |   55 |     65 |        1 |  65 |  55 |  100 |    65. |
| Online Church meeting |   20 |     30 |        1 |  30 |  20 |   30 |    100 |
|-----------------------+------+--------+----------+-----+-----+------+--------|
| SUM                   |    - |      - |        3 | 165 | 120 |  480 | 34.375 |
#+TBLFM: $5=$3 * $4::$6=$2*$4::$8=($5/$7)*100::@9$4=vsum(@2$4..@8$4)::@9$5=vsum(@2$5..@8$5)::@9$6=vsum(@2$6..@7$6)::@9$7=vsum(@2$7..@7$7)
** 2022/03/18
| 活动           | 难度 | 喜悦度 | 完成情况 |  HP |  MP | Goal |   StHP |
|----------------+------+--------+----------+-----+-----+------+--------|
| 写程序分析结果 |   65 |     70 |        0 |   0 |   0 |  100 |      0 |
| 写文章形成文字 |   85 |     80 |        0 |   0 |   0 |  100 |      0 |
| 练吉他         |   40 |     50 |        0 |   0 |   0 |   50 |      0 |
| 健身环         |   60 |     60 |        0 |   0 |   0 |   60 |      0 |
| 逛超市         |   65 |     70 |        0 |   0 |   0 |   70 |      0 |
| 出门           |   55 |     65 |        1 |  65 |  55 |  100 |   0.65 |
| 玩猫           |   30 |     80 |        1 |  80 |  30 |   80 |      1 |
|----------------+------+--------+----------+-----+-----+------+--------|
| SUM            |    - |      - |        2 | 165 | 120 |  480 | 34.375 |
#+TBLFM: $5=$3*$4::$6=$2*$4::$8=$5/$7::@9$4=vsum(@2$4..@8$4)
** 2022/03/19
| 活动           | 难度 | 喜悦度 | 完成情况 |  HP |  MP | Goal |      StHP |
|----------------+------+--------+----------+-----+-----+------+-----------|
| 写程序分析结果 |   65 |     70 |        0 |   0 |   0 |  100 |         0 |
| 写文章形成文字 |   85 |     80 |        0 |   0 |   0 |  100 |         0 |
| 练吉他         |   40 |     50 |        0 |   0 |   0 |   50 |         0 |
| 健身环         |   60 |     60 |        0 |   0 |   0 |   60 |         0 |
| 逛超市         |   65 |     70 |        0 |   0 |   0 |   70 |         0 |
| 出门           |   55 |     65 |        1 |  65 |  55 |  100 |       65. |
| 玩猫           |   30 |     80 |        2 | 160 |  60 |   80 |       200 |
| 读文章         |   60 |     70 |        2 | 140 | 120 |  140 |       100 |
|----------------+------+--------+----------+-----+-----+------+-----------|
| SUM            |    - |      - |        2 | 365 | 235 |  700 | 30.714286 |
#+TBLFM: $5=$3*$4::$6=$2*$4::$8=($5/$7)*100::@10$5=vsum(@2$5..@9$5)::@10$6=vsum(@2$6..@9$6)::@10$7=vsum(@2$7..@9$7)
** 2022/03/20
| 活动           | 难度 | 喜悦度 | 完成情况 |  HP |  MP | Goal |      StHP |
|----------------+------+--------+----------+-----+-----+------+-----------|
| 写程序分析结果 |   65 |     70 |        0 |   0 |   0 |  100 |         0 |
| 写文章形成文字 |   85 |     80 |        0 |   0 |   0 |  100 |         0 |
| 练吉他         |   40 |     50 |        0 |   0 |   0 |   50 |         0 |
| 健身环         |   60 |     60 |        0 |   0 |   0 |   60 |         0 |
| 逛超市         |   65 |     70 |        0 |   0 |   0 |   70 |         0 |
| 出门           |   55 |     65 |        1 |  65 |  55 |  100 |       65. |
| 玩猫           |   30 |     80 |        1 |  80 |  30 |   80 |       100 |
| 读文章         |   60 |     70 |        1 |  70 |  60 |  140 |       50. |
| Hiking         |   80 |    100 |        1 | 100 |  80 |   80 |      125. |
|----------------+------+--------+----------+-----+-----+------+-----------|
| SUM            |    - |      - |        2 | 315 | 225 |  780 | 31.410256 |
#+TBLFM: $5=$3*$4::$6=$2*$4::$8=($5/$7)*100::@11$5=vsum(@2$5..@10$5)::@11$6=vsum(@2$6..@10$6)::@11$7=vsum(@2$7..@10$7)
** 2022/03/21
| 活动           | 难度 | 喜悦度 | 完成情况 |  HP |  MP | Goal |      StHP |
|----------------+------+--------+----------+-----+-----+------+-----------|
| 写程序分析结果 |   65 |     70 |        0 |   0 |   0 |  100 |         0 |
| 写文章形成文字 |   85 |     80 |        0 |   0 |   0 |  100 |         0 |
| 练吉他         |   40 |     50 |        0 |   0 |   0 |   50 |         0 |
| 健身环         |   60 |     60 |        0 |   0 |   0 |   60 |         0 |
| 逛超市         |   65 |     70 |        0 |   0 |   0 |   70 |         0 |
| 出门           |   55 |     65 |        1 |  65 |  55 |  100 |       65. |
| 玩猫           |   30 |     80 |        1 |  80 |  30 |   80 |       100 |
| 读文章         |   60 |     70 |        1 |  70 |  60 |  140 |       50. |
|----------------+------+--------+----------+-----+-----+------+-----------|
| SUM            |    - |      - |        3 | 215 | 145 |  700 | 30.714286 |
#+TBLFM: $5=$3*$4::$6=$2*$4::$8=($5/$7)*100::@10$4=vsum(@2$4..@9$4)::@10$5=vsum(@2$5..@9$5)::@10$6=vsum(@2$6..@9$6)::@10$7=vsum(@2$7..@9$7)
** 2022/03/22
| 活动           | 难度 | 喜悦度 | 完成情况 |  HP |  MP | Goal |      StHP |
|----------------+------+--------+----------+-----+-----+------+-----------|
| 写程序分析结果 |   65 |     70 |        0 |   0 |   0 |  100 |         0 |
| 写文章形成文字 |   85 |     80 |        0 |   0 |   0 |  100 |         0 |
| 练吉他         |   40 |     50 |        0 |   0 |   0 |   50 |         0 |
| 健身环         |   60 |     60 |        0 |   0 |   0 |   60 |         0 |
| 逛超市         |   65 |     70 |        0 |   0 |   0 |   70 |         0 |
| 出门           |   55 |     65 |        1 |  65 |  55 |  100 |       65. |
| 玩猫           |   30 |     80 |        0 |   0 |   0 |   80 |         0 |
| 读文章         |   60 |     70 |        1 |  70 |  60 |  140 |       50. |
|----------------+------+--------+----------+-----+-----+------+-----------|
| SUM            |    - |      - |        2 | 135 | 115 |  700 | 30.714286 |
#+TBLFM: $5=$3*$4::$6=$2*$4::$8=($5/$7)*100::@10$4=vsum(@2$4..@9$4)::@10$5=vsum(@2$5..@9$5)::@10$6=vsum(@2$6..@9$6)::@10$7=vsum(@2$7..@9$7)
** 2022/04/04
| 活动           | 难度 | 喜悦度 | 完成情况 |  HP |  MP | Goal |      StHP |
|----------------+------+--------+----------+-----+-----+------+-----------|
| 写程序分析结果 |   65 |     70 |        0 |   0 |   0 |  100 |         0 |
| 写文章形成文字 |   85 |     80 |        0 |   0 |   0 |  100 |         0 |
| 练吉他         |   40 |     50 |        0 |   0 |   0 |   50 |         0 |
| 健身         |   60 |     60 |        0 |   0 |   0 |   60 |         0 |
| 逛超市         |   65 |     70 |        0 |   0 |   0 |   70 |         0 |
| 出门           |   55 |     65 |        1 |  65 |  55 |  100 |       65. |
| 读文章         |   60 |     70 |        1 |  70 |  60 |  140 |       50. |
|----------------+------+--------+----------+-----+-----+------+-----------|
| SUM            |    - |      - |        2 | 135 | 115 |  700 | 30.714286 |
#+TBLFM: $5=$3*$4::$6=$2*$4::$8=($5/$7)*100::@10$4=vsum(@2$4..@9$4)::@10$5=vsum(@2$5..@9$5)::@10$6=vsum(@2$6..@9$6)::@10$7=vsum(@2$7..@9$7)
